import styles from '../../scss/Statement.module.scss'

export default function Statement() {
  return (
    <div className={styles.containerWrapper}>
      <div className={styles.statementContainer}>
        <p>價格皆含稅與運送費用。</p>
        <p>
          ◊◊
          符合資格的購買者在符合資格的地點購買符合條件的產品時，同時搭配促銷優惠產品，可獲得促銷優惠金額。每位符合資格的購買者在購買符合條件的產品時，僅限搭配購買一件促銷優惠產品。優惠會隨供應狀況而有所變動。須遵守此處所列的條款與約定。
        </p>
        <p>
          ∆ Apple Intelligence 現已推出 Beta
          版。部分功能可能未於所有地區提供，或未適用於所有語言。有關功能和語言的支援狀況以及系統需求，請參閱
          support.apple.com/121115(以新視窗開啟)。
        </p>
        <p>
          ∆∆ 測試由 Apple 於 2025 年 7 月使用搭載測試版 AirPods 韌體的 AirPods
          Pro 3，配對搭載測試版 iOS 26 的 iPhone 16 進行。降噪測試根據 IEC
          60268-24
          標準進行。與測試當時市面上最暢銷的無線入耳式耳機進行比較。效能表現視裝置設定、環境與許多其他因素而定。
        </p>
        <p>
          1.
          實際換購估價視你折抵換購裝置的狀況、推出年份與機型而有所差異。並非所有裝置均符合折抵條件。你必須已達法定成年年齡，才有折抵換購的資格，以獲享折抵優惠或取得
          Apple Store 禮品卡。你現有裝置的價值，可能適用於購買新 Apple
          裝置，或加值到 Apple Store
          禮品卡。實際獲得的換購價值，是根據收到符合條件的裝置，是否吻合你在估價時所提供的描述而定。可能須按照新裝置的全額售價繳納加值型營業稅。店內換購須出示政府核發的有效照片證件，才能享有此項優惠
          (當地法律可能要求保存這份資訊)。優惠可能無法在所有直營店提供，店內和線上折抵換購的優惠可能會有所不同。部分直營店可能會有額外的要求。Apple
          或 Apple
          的換購服務合作夥伴保留以任何理由拒絕、取消任何折抵換購交易，或限制接受任何裝置
          (及其數量) 參與本優惠的權利。更多詳情可自 Apple
          的換購合作夥伴取得，以了解符合換購及回收條件的裝置。須遵守 Apple
          的換購服務合作夥伴所訂立的其他條款。
        </p>
        <p>
          2. 零利率分期付款方案僅適用於 NT$1,500
          以上之購買金額。零利率分期付款僅可在 Apple
          直營店、透過電話購買、透過交流購買及 Apple Online Store
          購物時享有。分期付款方案是由信用卡發卡銀行所提供：玉山銀行、台新銀行、星展銀行
          (台灣)、國泰世華銀行、台北富邦商業銀行、以及中國信託商業銀行。所有的零利率分期付款購物都須經你的信用卡發卡銀行核准。
          零利率分期付款的還款期限最長可達 12
          個月。不同銀行的還款期限與最低購買額度可能有所不同。
          若你的信用卡發卡銀行未核准你的訂單使用此零利率分期付款方案，Apple
          員工並無法得知其原因。由於技術因素，某些信用卡可能無法適用分期付款優惠。如須進一步了解你的分期付款購物授權結果，請聯絡你的信用卡發卡銀行。請參閱銀行網站以了解細則及各項費用。使用美國運通卡，金融卡或透過
          Apple Pay
          購物無法使用此方案。分期付款手續費將會出現於你的信用卡對帳單。此方案適用於廣告或標籤價格。所有訂單均享免額外付費運送服務。如果你想以零利率分期方式來付款，你必須刷信用卡
          (店內) 或輸入信用卡詳細資訊 (線上)
          才能下訂單。訂單一旦完成，便不能更改信用卡。若您要選用其他信用卡，必須取消目前的訂單，再重新下單。
        </p>
        <p>
          3.
          優惠價格適用於符合資格的顧客。如須進一步了解如何獲享優惠價資格，請洽詢直營店內的
          Apple 專員，或致電 0800-020-021 與我們聯繫。
        </p>
        <p>
          ⁺ 僅適用於新訂戶。試用結束後，每月
          NT$165。優惠限時提供，僅適用於擁有符合條件新裝置的 Apple Music
          新訂戶。符合條件的音訊裝置兌換優惠，須使用連接或配對執行最新 iOS 或
          iPadOS 的 Apple 裝置。Apple Watch 兌換優惠，須使用連接或配對執行最新
          iOS 的
          iPhone。優惠在符合條件裝置啟用後的三個月內有效。不論購買多少部符合條件的裝置，每個
          Apple
          帳號僅可獲享一次優惠。訂閱方案將自動續訂直到取消為止。須受限制與其他條款約束。
        </p>
      </div>
    </div>
  )
}
